# ElementTypeFailures Properties

---
The BuiltInFailuresElementTypeFailures type exposes the following members.
| Name| Description
---|---|---
| NoDefaultType|  As a result of Reloading Latest, there are no types of [User Name] left. Create a new type by duplicating an existing [User Name] type in the Project Browser.
| WarnLastType1|  Last type in system family '[Name]' cannot be deleted.
Top
#### Reference
BuiltInFailuresElementTypeFailures Class
Autodesk.Revit.DB Namespace